# 4. Реализуйте базовый класс Car.
# У данного класса должны быть следующие атрибуты:
# speed, color, name, is_police (булево).
# А также методы: go, stop, turn(direction),
# которые должны сообщать, что машина поехала,
# остановилась, повернула (куда). Опишите несколько дочерних классов:
# TownCar, SportCar, WorkCar, PoliceCar. Добавьте в базовый класс
# метод show_speed, который должен показывать текущую скорость автомобиля.
# Для классов TownCar и WorkCar переопределите метод show_speed.
# При значении скорости свыше 60 (TownCar) и 40 (WorkCar) должно выводиться сообщение о превышении скорости.
# Создайте экземпляры классов, передайте значения атрибутов.
# Выполните доступ к атрибутам, выведите результат.
# Выполните вызов методов и также покажите результат.

class Car:


    def __init__(self, speed, color, name, is_police):
        self.speed = speed
        self.color = color
        self.name = name
        self.is_police = is_police

    def go(self):
        print('Машина поехала')

    def stop(self):
        print('Машина остановилась')

    def turn(self, direction):
        print(f'Машина повернула {direction}')

    def show_speed(self):
        print(f'Скорость автомобиля {self.speed}км/ч')

class TownCar(Car):

    def show_speed(self):
        if self.speed > 60:
            print(f'Привышение скорости')

class SportCar(Car):
    pass
class WorkCar(Car):

    def show_speed(self):
        if self.speed > 40:
            print(f'Привышение скорости')

class PoliceCar(Car):
    pass


aaa = TownCar(100, "Red", "BMW", False)
aaa.go()
aaa.stop()
aaa.turn("налево")
#aaa.show_speed()

aaa.speed = 40
aaa.show_speed()