# 1. Реализовать скрипт, в котором должна быть
# предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу:
# (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений
# необходимо запускать скрипт с параметрами.

def salary_calculation():
    try:
        hours_worker = int(input("Колличество отработанных часов: "))
        rate = int(input("Ставка: "))
        award = int(input("Премия: "))
        print(f"Заработная плата составила {hours_worker * rate + award}₽")
    except ValueError:
        print("Ошибка введенных данных.")

salary_calculation()