# 5. Реализовать формирование списка,
# используя функцию range() и возможности генератора.
# В список должны войти четные числа от 100 до 1000 (включая границы).
# Необходимо получить результат вычисления произведения всех элементов списка.
# Подсказка: использовать функцию reduce().

from functools import reduce


def multiply_elements(el_p, el):
    return el_p * el

print(f'Результат перемножения всех элементов списка {reduce(multiply_elements, [el for el in range(99, 1001) if el % 2 == 0])}')
